In [1]:
import pandas as pd 
import numpy as np 
import seaborn as sns
import matplotlib as lyb

load data

In [2]:
data=pd.read_csv("../Data-cleaning-for-beginners-using-pandas.csv")
data.head()

   Index   Age     Salary  Rating       Location  Established Easy Apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2   NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

In [3]:
data.info()
data.shape
data.columns.tolist()
data.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Index        29 non-null     int64
 1   Age          22 non-null     float64
 2   Salary       29 non-null     object
 3   Rating       28 non-null     float64
 4   Location     29 non-null     object
 5   Established  29 non-null     int64
 6   Easy Apply   29 non-null     object
dtypes: float64(2), int64(2), object(3)
memory usage: 1.7+ KB

Index(['Index', 'Age', 'Salary', 'Rating', 'Location', 'Established',
       'Easy Apply'],
      dtype='object')

Find missing values in columns

In [4]:
missingValues=data.isnull().sum()
print(missingValues)
missingInAge=data[data['Age'].isnull()]
print(missingInAge)

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64
    Index  Age     Salary  Rating       Location  Established Easy Apply
2       2  NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
12     12  NaN  $44k-$99k     0.0       India,In         1999         -1
17     17  NaN  $44k-$99k     5.3    New York,Ny         1943       TRUE
20     20  NaN  $44k-$99k     5.7    New York,Ny         1944       TRUE
23     23  NaN  $44k-$99k     2.4    New York,Ny         1999       TRUE
26     26  NaN  $55k-$66k     NaN       India,In         1934       TRUE
28     28  NaN  $39k-$88k     3.4  Australia Aus         1932         -1

Q4: Salary Cleaning
Q4.1 â€” Extract minimum salary into a new column named MinSalary.
Q4.2 â€” Extract maximum salary into a new column MaxSalary.
Q4.3 â€” Convert both into proper integers (44000, 99000, etc.).

In [5]:


#4.1
data["MinSalary"]=(
    data['Salary']
    .str.replace("$","",regex=False)
    .str.replace("k","",regex=False)
    .str.split("-",expand=True)[0]
    .astype(int)*1000

)

#4.2

data["MaxSalary"]=(
    data['Salary']
    .str.replace("$","",regex=False)
    .str.replace("k","",regex=False)
    .str.split("-",expand=True)[1]
    .astype(int)*1000
)
data.head()

,Index,Age,Salary,Rating,Location,Established,Easy Apply,MinSalary,MaxSalary
0,0,44.0,$44k-$99k,5.4,"India,In",1999,TRUE,44000,99000
1,1,66.0,$55k-$66k,3.5,"New York,Ny",2002,TRUE,55000,66000
2,2,NaN,$77k-$89k,-1.0,"New York,Ny",-1,-1,77000,89000
3,3,64.0,$44k-$99k,4.4,India In,1988,-1,44000,99000
4,4,25.0,$44k-$99k,6.4,Australia Aus,2002,-1,44000,99000

Now Let's Move to LEVEL 2 â€“ Q5 (Location Cleaning)

In [6]:
data['Location']=data['Location'].str.rsplit(" ",n=1).str.join(",")
data[["City","Country"]]=data["Location"].str.rsplit(",",n=1,expand=True)


data.head()

,Index,Age,Salary,Rating,Location,Established,Easy Apply,MinSalary,MaxSalary,City,Country
0,0,44.0,$44k-$99k,5.4,"India,In",1999,TRUE,44000,99000,India,In
1,1,66.0,$55k-$66k,3.5,"New,York,Ny",2002,TRUE,55000,66000,"New,York",Ny
2,2,NaN,$77k-$89k,-1.0,"New,York,Ny",-1,-1,77000,89000,"New,York",Ny
3,3,64.0,$44k-$99k,4.4,"India,In",1988,-1,44000,99000,India,In
4,4,25.0,$44k-$99k,6.4,"Australia,Aus",2002,-1,44000,99000,Australia,Aus

In [7]:
data['City']=data['City'].str.replace(","," ",1)
data.head()

,Index,Age,Salary,Rating,Location,Established,Easy Apply,MinSalary,MaxSalary,City,Country
0,0,44.0,$44k-$99k,5.4,"India,In",1999,TRUE,44000,99000,India,In
1,1,66.0,$55k-$66k,3.5,"New,York,Ny",2002,TRUE,55000,66000,New York,Ny
2,2,NaN,$77k-$89k,-1.0,"New,York,Ny",-1,-1,77000,89000,New York,Ny
3,3,64.0,$44k-$99k,4.4,"India,In",1988,-1,44000,99000,India,In
4,4,25.0,$44k-$99k,6.4,"Australia,Aus",2002,-1,44000,99000,Australia,Aus

Next Task (LEVEL 2 â€“ Q6) 
Q6 â€” Replace:

Rating: -1 â†’ NaN

Established: -1 â†’ NaN

Easy Apply: -1 â†’ "UNKNOWN"

In [8]:
data["Rating"]=data["Rating"].replace(-1,np.nan)
data["Established"]=data["Established"].replace(-1,np.nan)
data['Easy Apply']=data["Easy Apply"].str.replace("NaN","UNKNOWN")
data.head()

,Index,Age,Salary,Rating,Location,Established,Easy Apply,MinSalary,MaxSalary,City,Country
0,0,44.0,$44k-$99k,5.4,"India,In",1999.0,TRUE,44000,99000,India,In
1,1,66.0,$55k-$66k,3.5,"New,York,Ny",2002.0,TRUE,55000,66000,New York,Ny
2,2,NaN,$77k-$89k,NaN,"New,York,Ny",NaN,-1,77000,89000,New York,Ny
3,3,64.0,$44k-$99k,4.4,"India,In",1988.0,-1,44000,99000,India,In
4,4,25.0,$44k-$99k,6.4,"Australia,Aus",2002.0,-1,44000,99000,Australia,Aus

NEXT LEVEL (LEVEL 3 â€“ Advanced Pandas)

Now answer Q7:

Q7.1 â€” Find average Age for each Country.
Q7.2 â€” Find minimum and maximum salary (MinSalary, MaxSalary) by Country.

In [9]:
average=data.groupby("Country")["Age"].mean().round(2)
print("Average of Salary  each country : ",average)
maxSalary=data.groupby("Country")["MaxSalary"].max()

minSalary=data.groupby("Country")["MinSalary"].min()
print("Max Salary= ",maxSalary)
print("Min Salary= ",minSalary)

Average of Salary  each country :  Country
Aus    43.17
In     43.00
Ny     32.00
Name: Age, dtype: float64
Max Salary=  Country
Aus    101000
In      99000
Ny      99000
Name: MaxSalary, dtype: int64
Min Salary=  Country
Aus    39000
In     10000
Ny     44000
Name: MinSalary, dtype: int64

Now Let's Move to LEVEL 3 â€“ Q8 (Outlier Detection using IQR)

Write code for:

Q8.1 â€” Compute IQR for Rating
Q8.2 â€” Get all rows where Rating is an outlier

In [14]:
Q1=data["Rating"].quantile(0.25)
Q3=data["Rating"].quantile(0.75)

IQR=Q3-Q1

lower=Q1-1.5*IQR
upper=Q3+1.5*IQR


outliner=data[(data["Rating"]<lower) | (data["Rating"]>upper)]
print(outliner)

Empty DataFrame
Columns: [Index, Age, Salary, Rating, Location, Established, Easy Apply, MinSalary, MaxSalary, City, Country]
Index: []

ðŸš€ Q9: Create Experience Level Column

In [17]:
data["Experience Level"]=np.where(data["Age"]<30,"Junior",np.where(data["Age"]<=50 ,"mid","Senior"))
data.head()

,Index,Age,Salary,Rating,Location,Established,Easy Apply,MinSalary,MaxSalary,City,Country,Experience Level
0,0,44.0,$44k-$99k,5.4,"India,In",1999.0,TRUE,44000,99000,India,In,mid
1,1,66.0,$55k-$66k,3.5,"New,York,Ny",2002.0,TRUE,55000,66000,New York,Ny,Senior
2,2,NaN,$77k-$89k,NaN,"New,York,Ny",NaN,-1,77000,89000,New York,Ny,Senior
3,3,64.0,$44k-$99k,4.4,"India,In",1988.0,-1,44000,99000,India,In,Senior
4,4,25.0,$44k-$99k,6.4,"Australia,Aus",2002.0,-1,44000,99000,Australia,Aus,Junior